espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/simw-top-mini/repo/demos/ksdk/common/boards/DK6/wireless_examples/chip/pin_mux.c
static void ConfigureDongleLEDs(void)
{
    const uint32_t port0_pin4_config = (/* Pin is configured as PIO0_4 */
                                        IOCON_PIO_FUNC0 |
                                        /* Selects pull-up function */
                                        IOCON_PIO_MODE_PULLUP |
                                        /* Standard mode, output slew rate control is disabled */
                                        IOCON_PIO_SLEW0_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Standard mode, output slew rate control is disabled */
                                        IOCON_PIO_SLEW1_STANDARD |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI |
                                        /* SSEL is disabled */
                                        IOCON_PIO_SSEL_DI);
    /* PORT0 PIN4 (coords: 7) is configured as PIO0_4 */
    IOCON_PinMuxSet(IOCON, 0U, 4U, port0_pin4_config);

//This Pin is Used for I2C communication with Secure Element
    // const uint32_t port0_pin10_config = (/* Pin is configured as PIO0_10 */
    //                                      IOCON_PIO_FUNC0 |
    //                                      /* GPIO mode */
    //                                      IOCON_PIO_EGP_GPIO |
    //                                      /* IO is an open drain cell */
    //                                      IOCON_PIO_ECS_DI |
    //                                      /* High speed IO for GPIO mode, IIC not */
    //                                      IOCON_PIO_EHS_DI |
    //                                      /* Input function is not inverted */
    //                                      IOCON_PIO_INV_DI |
    //                                      /* Enables digital function */
    //                                      IOCON_PIO_DIGITAL_EN |
    //                                      /* Input filter disabled */
    //                                      IOCON_PIO_INPFILT_OFF |
    //                                      /* IIC mode:Noise pulses below approximately 50ns are filtered out. GPIO mode:a 3ns filter */
    //                                      IOCON_PIO_FSEL_DI |
    //                                      /* Open drain is disabled */
    //                                      IOCON_PIO_OPENDRAIN_DI |
    //                                      /* IO_CLAMP disabled */
    //                                      IOCON_PIO_IO_CLAMP_DI);
    // /* PORT0 PIN10 (coords: 13) is configured as PIO0_10 */
    // IOCON_PinMuxSet(IOCON, 0U, 10U, port0_pin10_config);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void BOARD_InitPins(void)
{
    /* Define the init structure for the output LED pin*/
    gpio_pin_config_t led_config = {
        kGPIO_DigitalOutput,
        0,
    };
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    CLOCK_EnableClock(kCLOCK_InputMux);

    /* Debugger signals */
    ConfigureDebugPort();
    BOARD_InitAppUARTPins();

    ConfigureDongleLEDs();

    /* IOCON clock left on, this is needed if CLKIN is used. */
    /* Initialize GPIO */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    RESET_PeripheralReset(kGPIO0_RST_SHIFT_RSTn);

    /* Init output LED GPIO. */
    GPIO_PortInit(BOARD_LED_USB_DONGLE_GPIO, BOARD_LED_USB_DONGLE_GPIO_PORT);
    GPIO_PinInit(BOARD_LED_USB_DONGLE_GPIO, BOARD_LED_USB_DONGLE_GPIO_PORT, BOARD_LED_USB_DONGLE1_GPIO_PIN, &led_config);
    GPIO_PinInit(BOARD_LED_USB_DONGLE_GPIO, BOARD_LED_USB_DONGLE_GPIO_PORT, BOARD_LED_USB_DONGLE2_GPIO_PIN, &led_config);

 //   GPIO_PortToggle(BOARD_LED_USB_DONGLE_GPIO, BOARD_LED_USB_DONGLE_GPIO_PORT, 1u << BOARD_LED_USB_DONGLE1_GPIO_PIN);
    const uint32_t port0_pin10_config = (/* Pin is configured as I2C0_SCL */
                                         IOCON_PIO_FUNC5 |
                                         /* I2C mode */
                                         IOCON_PIO_EGP_I2C |
                                         /* IO is an open drain cell */
                                         IOCON_PIO_ECS_DI |
                                         /* High speed IO for GPIO mode, IIC not */
                                         IOCON_PIO_EHS_DI |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Input filter disabled */
                                         IOCON_PIO_INPFILT_OFF |
                                         /* IIC mode:Noise pulses below approximately 50ns are filtered out. GPIO mode:a 3ns filter */
                                         IOCON_PIO_FSEL_DI |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI |
                                         /* IO_CLAMP disabled */
                                         IOCON_PIO_IO_CLAMP_DI);
    /* PORT0 PIN10 (coords: 13) is configured as I2C0_SCL */
    IOCON_PinMuxSet(IOCON, 0U, 10U, port0_pin10_config);

