espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/simw-top-mini/repo/demos/ksdk/common/boards/DK6/wireless_examples/chip/pin_mux.c
    const uint32_t port0_pin11_config = (/* Pin is configured as I2C0_SDA */
                                         IOCON_PIO_FUNC5 |
                                         /* I2C mode */
                                         IOCON_PIO_EGP_I2C |
                                         /* IO is an open drain cell */
                                         IOCON_PIO_ECS_DI |
                                         /* High speed IO for GPIO mode, IIC not */
                                         IOCON_PIO_EHS_DI |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Input filter disabled */
                                         IOCON_PIO_INPFILT_OFF |
                                         /* IIC mode:Noise pulses below approximately 50ns are filtered out. GPIO mode:a 3ns filter */
                                         IOCON_PIO_FSEL_DI |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI |
                                         /* IO_CLAMP disabled */
                                         IOCON_PIO_IO_CLAMP_DI);
    /* PORT0 PIN11 (coords: 14) is configured as I2C0_SDA */
    IOCON_PinMuxSet(IOCON, 0U, 11U, port0_pin11_config);

    // const uint32_t port0_pin12_config = (/* Pin is configured as SWCLK */
    //                                      IOCON_PIO_FUNC2 |
    //                                      /* Selects pull-up function */
    //                                      IOCON_PIO_MODE_PULLUP |
    //                                      /* Standard mode, output slew rate control is disabled */
    //                                      IOCON_PIO_SLEW0_STANDARD |
    //                                      /* Input function is not inverted */
    //                                      IOCON_PIO_INV_DI |
    //                                      /* Enables digital function */
    //                                      IOCON_PIO_DIGITAL_EN |
    //                                      /* Input filter disabled */
    //                                      IOCON_PIO_INPFILT_OFF |
    //                                      /* Standard mode, output slew rate control is disabled */
    //                                      IOCON_PIO_SLEW1_STANDARD |
    //                                      /* Open drain is disabled */
    //                                      IOCON_PIO_OPENDRAIN_DI |
    //                                      /* SSEL is disabled */
    //                                      IOCON_PIO_SSEL_DI);
    // /* PORT0 PIN12 (coords: 15) is configured as SWCLK */
    // IOCON_PinMuxSet(IOCON, 0U, 12U, port0_pin12_config);

    // const uint32_t port0_pin13_config = (/* Pin is configured as SWDIO */
    //                                      IOCON_PIO_FUNC2 |
    //                                      /* Selects pull-up function */
    //                                      IOCON_PIO_MODE_PULLUP |
    //                                      /* Standard mode, output slew rate control is disabled */
    //                                      IOCON_PIO_SLEW0_STANDARD |
    //                                      /* Input function is not inverted */
    //                                      IOCON_PIO_INV_DI |
    //                                      /* Enables digital function */
    //                                      IOCON_PIO_DIGITAL_EN |
    //                                      /* Input filter disabled */
    //                                      IOCON_PIO_INPFILT_OFF |
    //                                      /* Standard mode, output slew rate control is disabled */
    //                                      IOCON_PIO_SLEW1_STANDARD |
    //                                      /* Open drain is disabled */
    //                                      IOCON_PIO_OPENDRAIN_DI |
    //                                      /* SSEL is disabled */
    //                                      IOCON_PIO_SSEL_DI);
    // /* PORT0 PIN13 (coords: 16) is configured as SWDIO */
    // IOCON_PinMuxSet(IOCON, 0U, 13U, port0_pin13_config);


}
void BOARD_LedDongleToggle(void)
{
    GPIO_PortToggle(BOARD_LED_USB_DONGLE_GPIO, BOARD_LED_USB_DONGLE_GPIO_PORT, 1u << BOARD_LED_USB_DONGLE1_GPIO_PIN);
    GPIO_PortToggle(BOARD_LED_USB_DONGLE_GPIO, BOARD_LED_USB_DONGLE_GPIO_PORT, 1u << BOARD_LED_USB_DONGLE2_GPIO_PIN);
}


/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
